goods = []
n = 1

features = {'наим': '', 'цена': '', 'кол-во': '', 'ед': ''}
analytics = {'наим': [], 'цена': [], 'кол-во': [], 'ед': []}



"""while n <= goods:
    my_dict = dict({'название': input("введите название "), 'цена': input("Введите цену "),
                    'количество': input('Введите количество '), 'eд': input("Введите единицу измерения ")})
    my_list.append((n, my_dict))
    n += 1
    #print(my_list)
    #my_analys = dict(
    #    {'название': my_dict.get('название'), 'цена': my_dict.get('цена'), 'количество': my_dict.get('количество'),
    #     'ед': my_dict.get('ед')})"""