import random

# общая сложность - логарифмическая

#############################################################################################
def check_1(lst_obj):
    # линейная
    lst_to_set = set(lst_obj)  # !!! линейная - зависит от количества элементов
    return lst_to_set  # !!! константная (постоянная)


#############################################################################################
def check_2(lst_obj):
    # линейная
    for j in range(len(lst_obj)):          # !!! линейная - зависит от кол. элементов
        if lst_obj[j] in lst_obj[j+1:]:    # !!! линейная 
            return False                   # !!! константная (постоянная)
    return True                            # !!! константная (постоянная)


#############################################################################################
def check_3(lst_obj):
    # логарифмическая
    lst_copy = list(lst_obj)                 # !!! линейная
    lst_copy.sort()                          # !!! логарифмическая
    for i in range(len(lst_obj) - 1):        # !!! линейная
        if lst_copy[i] == lst_copy[i+1]:     # !!! линейная
            return False                     # !!! постоянная
    return True                              # !!! постоянная

#############################################################################################


for j in (50, 500, 1000, 5000, 1000):
    # Из 100000 чисел возьмем 'j' случайно выбранных
    # Всего 10 тыс. чисел
    lst = random.sample(range(-100000, 100000), j)

print(check_1(lst))
print(check_2(lst))
print(check_3(lst))
